# Zone Heating Air Temperature Property

Source: https://www.revitapidocs.com/2026/2dfef226-72d9-ca2b-d622-4c1ea0130575.htm

---

| Zone Heating Air Temperature Property |
| --- |

**Note: This API is now obsolete.**

Get or set the Heating Air Temperature of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
public double HeatingAirTemperature { get; set; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>
Public Property HeatingAirTemperature As Double
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
property double HeatingAirTemperature {
	double get ();
	void set (double value);
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>]
member HeatingAirTemperature : float with get, set
```

#### Property Value

Double Remarks This property is used to get or set the Heating Air Temperature of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace